{
    "value":  [
                  "{\r\n    \"@odata.type\":  \"#microsoft.graph.macOSGeneralDeviceConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"1\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  null,\r\n    \"displayName\":  \"ADMIN0 - PPPC-restore-20-12-2023-22-36-45\",\r\n    \"compliantAppListType\":  \"none\",\r\n    \"emailInDomainSuffixes\":  [\r\n\r\n                              ],\r\n    \"passwordBlockSimple\":  false,\r\n    \"passwordExpirationDays\":  null,\r\n    \"passwordMinimumCharacterSetCount\":  null,\r\n    \"passwordMinimumLength\":  null,\r\n    \"passwordMinutesOfInactivityBeforeLock\":  null,\r\n    \"passwordMinutesOfInactivityBeforeScreenTimeout\":  null,\r\n    \"passwordPreviousPasswordBlockCount\":  null,\r\n    \"passwordRequiredType\":  \"deviceDefault\",\r\n    \"passwordRequired\":  false,\r\n    \"passwordMaximumAttemptCount\":  null,\r\n    \"passwordMinutesUntilFailedLoginReset\":  null,\r\n    \"keychainBlockCloudSync\":  false,\r\n    \"safariBlockAutofill\":  false,\r\n    \"cameraBlocked\":  false,\r\n    \"iTunesBlockMusicService\":  false,\r\n    \"spotlightBlockInternetResults\":  false,\r\n    \"keyboardBlockDictation\":  false,\r\n    \"definitionLookupBlocked\":  false,\r\n    \"appleWatchBlockAutoUnlock\":  false,\r\n    \"iTunesBlockFileSharing\":  false,\r\n    \"iCloudBlockDocumentSync\":  false,\r\n    \"iCloudBlockMail\":  false,\r\n    \"iCloudBlockAddressBook\":  false,\r\n    \"iCloudBlockCalendar\":  false,\r\n    \"iCloudBlockReminders\":  false,\r\n    \"iCloudBlockBookmarks\":  false,\r\n    \"iCloudBlockNotes\":  false,\r\n    \"airDropBlocked\":  false,\r\n    \"passwordBlockModification\":  false,\r\n    \"passwordBlockFingerprintUnlock\":  false,\r\n    \"passwordBlockAutoFill\":  false,\r\n    \"passwordBlockProximityRequests\":  false,\r\n    \"passwordBlockAirDropSharing\":  false,\r\n    \"softwareUpdatesEnforcedDelayInDays\":  null,\r\n    \"updateDelayPolicy\":  null,\r\n    \"contentCachingBlocked\":  false,\r\n    \"iCloudBlockPhotoLibrary\":  false,\r\n    \"screenCaptureBlocked\":  false,\r\n    \"classroomAppBlockRemoteScreenObservation\":  false,\r\n    \"classroomAppForceUnpromptedScreenObservation\":  false,\r\n    \"classroomForceAutomaticallyJoinClasses\":  false,\r\n    \"classroomForceRequestPermissionToLeaveClasses\":  false,\r\n    \"classroomForceUnpromptedAppAndDeviceLock\":  false,\r\n    \"iCloudBlockActivityContinuation\":  false,\r\n    \"addingGameCenterFriendsBlocked\":  false,\r\n    \"gameCenterBlocked\":  false,\r\n    \"multiplayerGamingBlocked\":  false,\r\n    \"wallpaperModificationBlocked\":  false,\r\n    \"eraseContentAndSettingsBlocked\":  false,\r\n    \"softwareUpdateMajorOSDeferredInstallDelayInDays\":  null,\r\n    \"softwareUpdateMinorOSDeferredInstallDelayInDays\":  null,\r\n    \"softwareUpdateNonOSDeferredInstallDelayInDays\":  null,\r\n    \"touchIdTimeoutInHours\":  null,\r\n    \"iCloudPrivateRelayBlocked\":  false,\r\n    \"iCloudDesktopAndDocumentsBlocked\":  false,\r\n    \"activationLockWhenSupervisedAllowed\":  false,\r\n    \"compliantAppsList\":  [\r\n\r\n                          ],\r\n    \"privacyAccessControls\":  [\r\n                                  {\r\n                                      \"displayName\":  \"Finder\",\r\n                                      \"identifier\":  \"com.apple.finder\",\r\n                                      \"identifierType\":  \"bundleID\",\r\n                                      \"codeRequirement\":  \"identifier \\\"com.apple.finder\\\" and anchor apple\",\r\n                                      \"staticCodeValidation\":  false,\r\n                                      \"blockCamera\":  false,\r\n                                      \"blockMicrophone\":  false,\r\n                                      \"blockScreenCapture\":  false,\r\n                                      \"blockListenEvent\":  false,\r\n                                      \"speechRecognition\":  \"enabled\",\r\n                                      \"accessibility\":  \"enabled\",\r\n                                      \"addressBook\":  \"enabled\",\r\n                                      \"calendar\":  \"enabled\",\r\n                                      \"reminders\":  \"enabled\",\r\n                                      \"photos\":  \"enabled\",\r\n                                      \"mediaLibrary\":  \"enabled\",\r\n                                      \"fileProviderPresence\":  \"enabled\",\r\n                                      \"systemPolicyAllFiles\":  \"enabled\",\r\n                                      \"systemPolicySystemAdminFiles\":  \"enabled\",\r\n                                      \"systemPolicyDesktopFolder\":  \"enabled\",\r\n                                      \"systemPolicyDocumentsFolder\":  \"enabled\",\r\n                                      \"systemPolicyDownloadsFolder\":  \"enabled\",\r\n                                      \"systemPolicyNetworkVolumes\":  \"enabled\",\r\n                                      \"systemPolicyRemovableVolumes\":  \"enabled\",\r\n                                      \"postEvent\":  \"enabled\",\r\n                                      \"appleEventsAllowedReceivers\":  [\r\n\r\n                                                                      ]\r\n                                  },\r\n                                  {\r\n                                      \"displayName\":  \"Microsoft Intune Agent\",\r\n                                      \"identifier\":  \"com.microsoft.intuneMDMAgent\",\r\n                                      \"identifierType\":  \"bundleID\",\r\n                                      \"codeRequirement\":  \"identifier \\\"com.microsoft.intuneMDMAgent\\\" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9\",\r\n                                      \"staticCodeValidation\":  false,\r\n                                      \"blockCamera\":  false,\r\n                                      \"blockMicrophone\":  false,\r\n                                      \"blockScreenCapture\":  false,\r\n                                      \"blockListenEvent\":  false,\r\n                                      \"speechRecognition\":  \"enabled\",\r\n                                      \"accessibility\":  \"enabled\",\r\n                                      \"addressBook\":  \"enabled\",\r\n                                      \"calendar\":  \"enabled\",\r\n                                      \"reminders\":  \"enabled\",\r\n                                      \"photos\":  \"enabled\",\r\n                                      \"mediaLibrary\":  \"enabled\",\r\n                                      \"fileProviderPresence\":  \"enabled\",\r\n                                      \"systemPolicyAllFiles\":  \"enabled\",\r\n                                      \"systemPolicySystemAdminFiles\":  \"enabled\",\r\n                                      \"systemPolicyDesktopFolder\":  \"enabled\",\r\n                                      \"systemPolicyDocumentsFolder\":  \"enabled\",\r\n                                      \"systemPolicyDownloadsFolder\":  \"enabled\",\r\n                                      \"systemPolicyNetworkVolumes\":  \"enabled\",\r\n                                      \"systemPolicyRemovableVolumes\":  \"enabled\",\r\n                                      \"postEvent\":  \"enabled\",\r\n                                      \"appleEventsAllowedReceivers\":  [\r\n\r\n                                                                      ]\r\n                                  }\r\n                              ]\r\n}",
                  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
                  "ADMIN0 - PPPC",
                  [
                      "a8760e39-f3ec-48bd-a5e6-239bf6abd86d"
                  ],
                  {
                      "id":  "a8760e39-f3ec-48bd-a5e6-239bf6abd86d_f37739c3-cbd0-49ea-b9a7-05fa6861a828",
                      "source":  "direct",
                      "sourceId":  "a8760e39-f3ec-48bd-a5e6-239bf6abd86d",
                      "intent":  "apply",
                      "target":  {
                                     "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                     "deviceAndAppManagementAssignmentFilterId":  null,
                                     "deviceAndAppManagementAssignmentFilterType":  "none",
                                     "groupId":  "AZ-GRP-USR-EndUser0"
                                 }
                  }
              ],
    "Count":  5
}