{
    "value":  [
                  "{\r\n    \"@odata.context\":  \"https://graph.microsoft.com/beta/$metadata#deviceManagement/roleDefinitions/$entity\",\r\n    \"@odata.type\":  \"#microsoft.graph.deviceAndAppManagementRoleDefinition\",\r\n    \"displayName\":  \"_RhinoRole-restore-21-12-2023-09-11-41\",\r\n    \"description\":  \"Copy from School Admin\",\r\n    \"isBuiltInRoleDefinition\":  false,\r\n    \"isBuiltIn\":  false,\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"permissions\":  [\r\n                        {\r\n                            \"actions\":  [\r\n                                            \"Microsoft.Intune_Audit_Read\",\r\n                                            \"Microsoft.Intune_CorporateDeviceIdentifiers_Create\",\r\n                                            \"Microsoft.Intune_EnrollmentProgramToken_Create\",\r\n                                            \"Microsoft.Intune_ManagedDevices_Update\",\r\n                                            \"Microsoft.Intune_AssignmentFilter_Read\",\r\n                                            \"Microsoft.Intune_DeviceCompliancePolices_Assign\",\r\n                                            \"Microsoft.Intune_ManagedDevices_Delete\",\r\n                                            \"Microsoft.Intune_AppleEnrollmentProfiles_Assign\",\r\n                                            \"Microsoft.Intune_CorporateDeviceIdentifiers_Update\",\r\n                                            \"Microsoft.Intune_AndroidSync_UpdateApps\",\r\n                                            \"Microsoft.Intune_DeviceCompliancePolices_Delete\",\r\n                                            \"Microsoft.Intune_AppleEnrollmentProfiles_Delete\",\r\n                                            \"Microsoft.Intune_MicrosoftStoreForBusiness_Read\",\r\n                                            \"Microsoft.Intune_DeviceCompliancePolices_Update\",\r\n                                            \"Microsoft.Intune_RemoteAssistanceApp_ViewScreen\",\r\n                                            \"Microsoft.Intune_EnrollmentProgramToken_Update\",\r\n                                            \"Microsoft.Intune_AppleEnrollmentProfiles_Create\",\r\n                                            \"Microsoft.Intune_ManagedDevices_SetPrimaryUser\",\r\n                                            \"Microsoft.Intune_AppleEnrollmentProfiles_Update\",\r\n                                            \"Microsoft.Intune_RemoteTasks_ActivateDeviceEsim\",\r\n                                            \"Microsoft.Intune_AppleDeviceSerialNumbers_Read\",\r\n                                            \"Microsoft.Intune_EndpointAnalytics_Read\",\r\n                                            \"Microsoft.Intune_CorporateDeviceIdentifiers_Delete\",\r\n                                            \"Microsoft.Intune_RemoteTasks_CustomNotification\",\r\n                                            \"Microsoft.Intune_RemoteTasks_PlayLostModeSound\",\r\n                                            \"Microsoft.Intune_RemoteTasks_DeviceLogs\",\r\n                                            \"Microsoft.Intune_RemoteTasks_RebootNow\",\r\n                                            \"Microsoft.Intune_RemoteTasks_RemoteLock\",\r\n                                            \"Microsoft.Intune_RemoteTasks_RevokeAppleVppLicenses\",\r\n                                            \"Microsoft.Intune_RemoteTasks_RotateFileVaultKey\",\r\n                                            \"Microsoft.Intune_RemoteTasks_SyncDevice\",\r\n                                            \"Microsoft.Intune_AssignmentFilter_Create\",\r\n                                            \"Microsoft.Intune_RemoteTasks_EnableWindowsIntuneAgent\",\r\n                                            \"Microsoft.Intune_DerivedCredentials_Read\",\r\n                                            \"Microsoft.Intune_EndpointAnalytics_Create\",\r\n                                            \"Microsoft.Intune_Roles_Read\",\r\n                                            \"Microsoft.Intune_RemoteAssistanceApp_Elevation\",\r\n                                            \"Microsoft.Intune_MobileApps_ViewReports\",\r\n                                            \"Microsoft.Intune_RemoteAssistance_Read\",\r\n                                            \"Microsoft.Intune_EnrollmentProgramToken_Delete\",\r\n                                            \"Microsoft.Intune_DeviceCompliancePolices_Create\",\r\n                                            \"Microsoft.Intune_DeviceEnrollmentManagers_Read\",\r\n                                            \"Microsoft.Intune_SecurityBaselines_Delete\",\r\n                                            \"Microsoft.Intune_RemoteTasks_LocateDevice\",\r\n                                            \"Microsoft.Intune_RemoteTasks_ConfigurationManagerAction\",\r\n                                            \"Microsoft.Intune_Organization_Read\",\r\n                                            \"Microsoft.Intune_RemoteTasks_ResetPasscode\",\r\n                                            \"Microsoft.Intune_SecurityBaselines_Read\",\r\n                                            \"Microsoft.Intune_EndpointAnalytics_Delete\",\r\n                                            \"Microsoft.Intune_RemoteAssistance_Update\",\r\n                                            \"Microsoft.Intune_EndpointAnalytics_Update\",\r\n                                            \"Microsoft.Intune_EndpointProtection_Read\",\r\n                                            \"Microsoft.Intune_AssignmentFilter_Delete\",\r\n                                            \"Microsoft.Intune_AssignmentFilter_Update\",\r\n                                            \"Microsoft.Intune_MobileThreatDefense_Read\",\r\n                                            \"Microsoft.Intune_RemoteAssistanceApp_TakeFullControl\",\r\n                                            \"Microsoft.Intune_DeviceCompliancePolices_ViewReports\",\r\n                                            \"Microsoft.Intune_PolicySets_Assign\",\r\n                                            \"Microsoft.Intune_ManagedApps_Delete\",\r\n                                            \"Microsoft.Intune_PolicySets_Create\",\r\n                                            \"Microsoft.Intune_PolicySets_Update\",\r\n                                            \"Microsoft.Intune_DeviceConfigurations_Read\",\r\n                                            \"Microsoft.Intune_TermsAndConditions_Create\",\r\n                                            \"Microsoft.Intune_AppleDeviceSerialNumbers_Delete\",\r\n                                            \"Microsoft.Intune_AppleDeviceSerialNumbers_Update\",\r\n                                            \"Microsoft.Intune_ManagedDevices_Read\",\r\n                                            \"Microsoft.Intune_AppleDeviceSerialNumbers_Create\",\r\n                                            \"Microsoft.Intune_Customization_Create\",\r\n                                            \"Microsoft.Intune_RemoteTasks_GetFileVaultKey\",\r\n                                            \"Microsoft.Intune_RemoteTasks_WindowsDefender\",\r\n                                            \"Microsoft.Intune_TermsAndConditions_Delete\",\r\n                                            \"Microsoft.Intune_MobileApps_Read\",\r\n                                            \"Microsoft.Intune_AndroidSync_Read\",\r\n                                            \"Microsoft.Intune_ManagedApps_Read\",\r\n                                            \"Microsoft.Intune_MicrosoftStoreForBusiness_Modify\",\r\n                                            \"Microsoft.Intune_RemoteTasks_CleanPC\",\r\n                                            \"Microsoft.Intune_RemoteTasks_ShutDown\",\r\n                                            \"Microsoft.Intune_SecurityTasks_Update\",\r\n                                            \"Microsoft.Intune_TermsAndConditions_Read\",\r\n                                            \"Microsoft.Intune_SecurityBaselines_Create\",\r\n                                            \"Microsoft.Intune_SecurityBaselines_Update\",\r\n                                            \"Microsoft.Intune_SecurityBaselines_Assign\",\r\n                                            \"Microsoft.Intune_RemoteTasks_ManageSharedDeviceUsers\",\r\n                                            \"Microsoft.Intune_RemoteTasks_RequestRemoteAssistance\",\r\n                                            \"Microsoft.Intune_MobileApps_Delete\",\r\n                                            \"Microsoft.Intune_ManagedApps_Assign\",\r\n                                            \"Microsoft.Intune_MobileApps_Create\",\r\n                                            \"Microsoft.Intune_RemoteTasks_Retire\",\r\n                                            \"Microsoft.Intune_TermsAndConditions_Update\",\r\n                                            \"Microsoft.Intune_DerivedCredentials_Modify\",\r\n                                            \"Microsoft.Intune_MicrosoftDefenderATP_Read\",\r\n                                            \"Microsoft.Intune_CertificateConnector_Read\",\r\n                                            \"Microsoft.Intune_RemoteTasks_EnableLostMode\",\r\n                                            \"Microsoft.Intune_PolicySets_Read\",\r\n                                            \"Microsoft.Intune_ManagedApps_Wipe\",\r\n                                            \"Microsoft.Intune_DeviceCompliancePolices_Read\",\r\n                                            \"Microsoft.Intune_DeviceConfigurations_Assign\",\r\n                                            \"Microsoft.Intune_AppleEnrollmentProfiles_Read\",\r\n                                            \"Microsoft.Intune_Customization_Update\",\r\n                                            \"Microsoft.Intune_PartnerDeviceManagement_Read\",\r\n                                            \"Microsoft.Intune_DeviceConfigurations_Create\",\r\n                                            \"Microsoft.Intune_EnrollmentProgramToken_Read\",\r\n                                            \"Microsoft.Intune_AndroidSync_UpdateOnboarding\",\r\n                                            \"Microsoft.Intune_RemoteTasks_DisableLostMode\",\r\n                                            \"Microsoft.Intune_RemoteTasks_RotateBitLockerKeys\",\r\n                                            \"Microsoft.Intune_MobileApps_Relate\",\r\n                                            \"Microsoft.Intune_RemoteTasks_RotateLocalAdminPassword\",\r\n                                            \"Microsoft.Intune_AndroidSync_UpdateEnrollmentProfiles\",\r\n                                            \"Microsoft.Intune_WindowsEnterpriseCertificate_Modify\",\r\n                                            \"Microsoft.Intune_MobileApps_Assign\",\r\n                                            \"Microsoft.Intune_ManagedApps_Update\",\r\n                                            \"Microsoft.Intune_PolicySets_Delete\",\r\n                                            \"Microsoft.Intune_ManagedApps_Create\",\r\n                                            \"Microsoft.Intune_SecurityTasks_Read\",\r\n                                            \"Microsoft.Intune_RemoteTasks_Wipe\",\r\n                                            \"Microsoft.Intune_DeviceConfigurations_ViewReports\",\r\n                                            \"Microsoft.Intune_CorporateDeviceIdentifiers_Read\",\r\n                                            \"Microsoft.Intune_Customization_Assign\",\r\n                                            \"Microsoft.Intune_DeviceEnrollmentManagers_Update\",\r\n                                            \"Microsoft.Intune_RemoteTasks_BypassActivationLock\",\r\n                                            \"Microsoft.Intune_DeviceConfigurations_Update\",\r\n                                            \"Microsoft.Intune_RemoteTasks_UpdateDeviceAccount\",\r\n                                            \"Microsoft.Intune_WindowsEnterpriseCertificate_Read\",\r\n                                            \"Microsoft.Intune_Reports_Read\",\r\n                                            \"Microsoft.Intune_MobileApps_Update\",\r\n                                            \"Microsoft.Intune_Customization_Read\",\r\n                                            \"Microsoft.Intune_ManagedDevices_ViewReports\",\r\n                                            \"Microsoft.Intune_RemoteTasks_SetDeviceName\",\r\n                                            \"Microsoft.Intune_TermsAndConditions_Assign\",\r\n                                            \"Microsoft.Intune_CertificateConnector_Modify\",\r\n                                            \"Microsoft.Intune_DeviceConfigurations_Delete\",\r\n                                            \"Microsoft.Intune_RemoteAssistance_ViewReports\",\r\n                                            \"Microsoft.Intune_Customization_Delete\"\r\n                                        ],\r\n                            \"resourceActions\":  [\r\n                                                    {\r\n                                                        \"allowedResourceActions\":  [\r\n                                                                                       \"Microsoft.Intune_Audit_Read\",\r\n                                                                                       \"Microsoft.Intune_CorporateDeviceIdentifiers_Create\",\r\n                                                                                       \"Microsoft.Intune_EnrollmentProgramToken_Create\",\r\n                                                                                       \"Microsoft.Intune_ManagedDevices_Update\",\r\n                                                                                       \"Microsoft.Intune_AssignmentFilter_Read\",\r\n                                                                                       \"Microsoft.Intune_DeviceCompliancePolices_Assign\",\r\n                                                                                       \"Microsoft.Intune_ManagedDevices_Delete\",\r\n                                                                                       \"Microsoft.Intune_AppleEnrollmentProfiles_Assign\",\r\n                                                                                       \"Microsoft.Intune_CorporateDeviceIdentifiers_Update\",\r\n                                                                                       \"Microsoft.Intune_AndroidSync_UpdateApps\",\r\n                                                                                       \"Microsoft.Intune_DeviceCompliancePolices_Delete\",\r\n                                                                                       \"Microsoft.Intune_AppleEnrollmentProfiles_Delete\",\r\n                                                                                       \"Microsoft.Intune_MicrosoftStoreForBusiness_Read\",\r\n                                                                                       \"Microsoft.Intune_DeviceCompliancePolices_Update\",\r\n                                                                                       \"Microsoft.Intune_RemoteAssistanceApp_ViewScreen\",\r\n                                                                                       \"Microsoft.Intune_EnrollmentProgramToken_Update\",\r\n                                                                                       \"Microsoft.Intune_AppleEnrollmentProfiles_Create\",\r\n                                                                                       \"Microsoft.Intune_ManagedDevices_SetPrimaryUser\",\r\n                                                                                       \"Microsoft.Intune_AppleEnrollmentProfiles_Update\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_ActivateDeviceEsim\",\r\n                                                                                       \"Microsoft.Intune_AppleDeviceSerialNumbers_Read\",\r\n                                                                                       \"Microsoft.Intune_EndpointAnalytics_Read\",\r\n                                                                                       \"Microsoft.Intune_CorporateDeviceIdentifiers_Delete\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_CustomNotification\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_PlayLostModeSound\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_DeviceLogs\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_RebootNow\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_RemoteLock\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_RevokeAppleVppLicenses\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_RotateFileVaultKey\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_SyncDevice\",\r\n                                                                                       \"Microsoft.Intune_AssignmentFilter_Create\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_EnableWindowsIntuneAgent\",\r\n                                                                                       \"Microsoft.Intune_DerivedCredentials_Read\",\r\n                                                                                       \"Microsoft.Intune_EndpointAnalytics_Create\",\r\n                                                                                       \"Microsoft.Intune_Roles_Read\",\r\n                                                                                       \"Microsoft.Intune_RemoteAssistanceApp_Elevation\",\r\n                                                                                       \"Microsoft.Intune_MobileApps_ViewReports\",\r\n                                                                                       \"Microsoft.Intune_RemoteAssistance_Read\",\r\n                                                                                       \"Microsoft.Intune_EnrollmentProgramToken_Delete\",\r\n                                                                                       \"Microsoft.Intune_DeviceCompliancePolices_Create\",\r\n                                                                                       \"Microsoft.Intune_DeviceEnrollmentManagers_Read\",\r\n                                                                                       \"Microsoft.Intune_SecurityBaselines_Delete\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_LocateDevice\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_ConfigurationManagerAction\",\r\n                                                                                       \"Microsoft.Intune_Organization_Read\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_ResetPasscode\",\r\n                                                                                       \"Microsoft.Intune_SecurityBaselines_Read\",\r\n                                                                                       \"Microsoft.Intune_EndpointAnalytics_Delete\",\r\n                                                                                       \"Microsoft.Intune_RemoteAssistance_Update\",\r\n                                                                                       \"Microsoft.Intune_EndpointAnalytics_Update\",\r\n                                                                                       \"Microsoft.Intune_EndpointProtection_Read\",\r\n                                                                                       \"Microsoft.Intune_AssignmentFilter_Delete\",\r\n                                                                                       \"Microsoft.Intune_AssignmentFilter_Update\",\r\n                                                                                       \"Microsoft.Intune_MobileThreatDefense_Read\",\r\n                                                                                       \"Microsoft.Intune_RemoteAssistanceApp_TakeFullControl\",\r\n                                                                                       \"Microsoft.Intune_DeviceCompliancePolices_ViewReports\",\r\n                                                                                       \"Microsoft.Intune_PolicySets_Assign\",\r\n                                                                                       \"Microsoft.Intune_ManagedApps_Delete\",\r\n                                                                                       \"Microsoft.Intune_PolicySets_Create\",\r\n                                                                                       \"Microsoft.Intune_PolicySets_Update\",\r\n                                                                                       \"Microsoft.Intune_DeviceConfigurations_Read\",\r\n                                                                                       \"Microsoft.Intune_TermsAndConditions_Create\",\r\n                                                                                       \"Microsoft.Intune_AppleDeviceSerialNumbers_Delete\",\r\n                                                                                       \"Microsoft.Intune_AppleDeviceSerialNumbers_Update\",\r\n                                                                                       \"Microsoft.Intune_ManagedDevices_Read\",\r\n                                                                                       \"Microsoft.Intune_AppleDeviceSerialNumbers_Create\",\r\n                                                                                       \"Microsoft.Intune_Customization_Create\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_GetFileVaultKey\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_WindowsDefender\",\r\n                                                                                       \"Microsoft.Intune_TermsAndConditions_Delete\",\r\n                                                                                       \"Microsoft.Intune_MobileApps_Read\",\r\n                                                                                       \"Microsoft.Intune_AndroidSync_Read\",\r\n                                                                                       \"Microsoft.Intune_ManagedApps_Read\",\r\n                                                                                       \"Microsoft.Intune_MicrosoftStoreForBusiness_Modify\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_CleanPC\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_ShutDown\",\r\n                                                                                       \"Microsoft.Intune_SecurityTasks_Update\",\r\n                                                                                       \"Microsoft.Intune_TermsAndConditions_Read\",\r\n                                                                                       \"Microsoft.Intune_SecurityBaselines_Create\",\r\n                                                                                       \"Microsoft.Intune_SecurityBaselines_Update\",\r\n                                                                                       \"Microsoft.Intune_SecurityBaselines_Assign\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_ManageSharedDeviceUsers\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_RequestRemoteAssistance\",\r\n                                                                                       \"Microsoft.Intune_MobileApps_Delete\",\r\n                                                                                       \"Microsoft.Intune_ManagedApps_Assign\",\r\n                                                                                       \"Microsoft.Intune_MobileApps_Create\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_Retire\",\r\n                                                                                       \"Microsoft.Intune_TermsAndConditions_Update\",\r\n                                                                                       \"Microsoft.Intune_DerivedCredentials_Modify\",\r\n                                                                                       \"Microsoft.Intune_MicrosoftDefenderATP_Read\",\r\n                                                                                       \"Microsoft.Intune_CertificateConnector_Read\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_EnableLostMode\",\r\n                                                                                       \"Microsoft.Intune_PolicySets_Read\",\r\n                                                                                       \"Microsoft.Intune_ManagedApps_Wipe\",\r\n                                                                                       \"Microsoft.Intune_DeviceCompliancePolices_Read\",\r\n                                                                                       \"Microsoft.Intune_DeviceConfigurations_Assign\",\r\n                                                                                       \"Microsoft.Intune_AppleEnrollmentProfiles_Read\",\r\n                                                                                       \"Microsoft.Intune_Customization_Update\",\r\n                                                                                       \"Microsoft.Intune_PartnerDeviceManagement_Read\",\r\n                                                                                       \"Microsoft.Intune_DeviceConfigurations_Create\",\r\n                                                                                       \"Microsoft.Intune_EnrollmentProgramToken_Read\",\r\n                                                                                       \"Microsoft.Intune_AndroidSync_UpdateOnboarding\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_DisableLostMode\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_RotateBitLockerKeys\",\r\n                                                                                       \"Microsoft.Intune_MobileApps_Relate\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_RotateLocalAdminPassword\",\r\n                                                                                       \"Microsoft.Intune_AndroidSync_UpdateEnrollmentProfiles\",\r\n                                                                                       \"Microsoft.Intune_WindowsEnterpriseCertificate_Modify\",\r\n                                                                                       \"Microsoft.Intune_MobileApps_Assign\",\r\n                                                                                       \"Microsoft.Intune_ManagedApps_Update\",\r\n                                                                                       \"Microsoft.Intune_PolicySets_Delete\",\r\n                                                                                       \"Microsoft.Intune_ManagedApps_Create\",\r\n                                                                                       \"Microsoft.Intune_SecurityTasks_Read\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_Wipe\",\r\n                                                                                       \"Microsoft.Intune_DeviceConfigurations_ViewReports\",\r\n                                                                                       \"Microsoft.Intune_CorporateDeviceIdentifiers_Read\",\r\n                                                                                       \"Microsoft.Intune_Customization_Assign\",\r\n                                                                                       \"Microsoft.Intune_DeviceEnrollmentManagers_Update\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_BypassActivationLock\",\r\n                                                                                       \"Microsoft.Intune_DeviceConfigurations_Update\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_UpdateDeviceAccount\",\r\n                                                                                       \"Microsoft.Intune_WindowsEnterpriseCertificate_Read\",\r\n                                                                                       \"Microsoft.Intune_Reports_Read\",\r\n                                                                                       \"Microsoft.Intune_MobileApps_Update\",\r\n                                                                                       \"Microsoft.Intune_Customization_Read\",\r\n                                                                                       \"Microsoft.Intune_ManagedDevices_ViewReports\",\r\n                                                                                       \"Microsoft.Intune_RemoteTasks_SetDeviceName\",\r\n                                                                                       \"Microsoft.Intune_TermsAndConditions_Assign\",\r\n                                                                                       \"Microsoft.Intune_CertificateConnector_Modify\",\r\n                                                                                       \"Microsoft.Intune_DeviceConfigurations_Delete\",\r\n                                                                                       \"Microsoft.Intune_RemoteAssistance_ViewReports\",\r\n                                                                                       \"Microsoft.Intune_Customization_Delete\"\r\n                                                                                   ],\r\n                                                        \"notAllowedResourceActions\":  [\r\n\r\n                                                                                      ]\r\n                                                    }\r\n                                                ]\r\n                        }\r\n                    ],\r\n    \"rolePermissions\":  [\r\n                            {\r\n                                \"actions\":  [\r\n                                                \"Microsoft.Intune_Audit_Read\",\r\n                                                \"Microsoft.Intune_CorporateDeviceIdentifiers_Create\",\r\n                                                \"Microsoft.Intune_EnrollmentProgramToken_Create\",\r\n                                                \"Microsoft.Intune_ManagedDevices_Update\",\r\n                                                \"Microsoft.Intune_AssignmentFilter_Read\",\r\n                                                \"Microsoft.Intune_DeviceCompliancePolices_Assign\",\r\n                                                \"Microsoft.Intune_ManagedDevices_Delete\",\r\n                                                \"Microsoft.Intune_AppleEnrollmentProfiles_Assign\",\r\n                                                \"Microsoft.Intune_CorporateDeviceIdentifiers_Update\",\r\n                                                \"Microsoft.Intune_AndroidSync_UpdateApps\",\r\n                                                \"Microsoft.Intune_DeviceCompliancePolices_Delete\",\r\n                                                \"Microsoft.Intune_AppleEnrollmentProfiles_Delete\",\r\n                                                \"Microsoft.Intune_MicrosoftStoreForBusiness_Read\",\r\n                                                \"Microsoft.Intune_DeviceCompliancePolices_Update\",\r\n                                                \"Microsoft.Intune_RemoteAssistanceApp_ViewScreen\",\r\n                                                \"Microsoft.Intune_EnrollmentProgramToken_Update\",\r\n                                                \"Microsoft.Intune_AppleEnrollmentProfiles_Create\",\r\n                                                \"Microsoft.Intune_ManagedDevices_SetPrimaryUser\",\r\n                                                \"Microsoft.Intune_AppleEnrollmentProfiles_Update\",\r\n                                                \"Microsoft.Intune_RemoteTasks_ActivateDeviceEsim\",\r\n                                                \"Microsoft.Intune_AppleDeviceSerialNumbers_Read\",\r\n                                                \"Microsoft.Intune_EndpointAnalytics_Read\",\r\n                                                \"Microsoft.Intune_CorporateDeviceIdentifiers_Delete\",\r\n                                                \"Microsoft.Intune_RemoteTasks_CustomNotification\",\r\n                                                \"Microsoft.Intune_RemoteTasks_PlayLostModeSound\",\r\n                                                \"Microsoft.Intune_RemoteTasks_DeviceLogs\",\r\n                                                \"Microsoft.Intune_RemoteTasks_RebootNow\",\r\n                                                \"Microsoft.Intune_RemoteTasks_RemoteLock\",\r\n                                                \"Microsoft.Intune_RemoteTasks_RevokeAppleVppLicenses\",\r\n                                                \"Microsoft.Intune_RemoteTasks_RotateFileVaultKey\",\r\n                                                \"Microsoft.Intune_RemoteTasks_SyncDevice\",\r\n                                                \"Microsoft.Intune_AssignmentFilter_Create\",\r\n                                                \"Microsoft.Intune_RemoteTasks_EnableWindowsIntuneAgent\",\r\n                                                \"Microsoft.Intune_DerivedCredentials_Read\",\r\n                                                \"Microsoft.Intune_EndpointAnalytics_Create\",\r\n                                                \"Microsoft.Intune_Roles_Read\",\r\n                                                \"Microsoft.Intune_RemoteAssistanceApp_Elevation\",\r\n                                                \"Microsoft.Intune_MobileApps_ViewReports\",\r\n                                                \"Microsoft.Intune_RemoteAssistance_Read\",\r\n                                                \"Microsoft.Intune_EnrollmentProgramToken_Delete\",\r\n                                                \"Microsoft.Intune_DeviceCompliancePolices_Create\",\r\n                                                \"Microsoft.Intune_DeviceEnrollmentManagers_Read\",\r\n                                                \"Microsoft.Intune_SecurityBaselines_Delete\",\r\n                                                \"Microsoft.Intune_RemoteTasks_LocateDevice\",\r\n                                                \"Microsoft.Intune_RemoteTasks_ConfigurationManagerAction\",\r\n                                                \"Microsoft.Intune_Organization_Read\",\r\n                                                \"Microsoft.Intune_RemoteTasks_ResetPasscode\",\r\n                                                \"Microsoft.Intune_SecurityBaselines_Read\",\r\n                                                \"Microsoft.Intune_EndpointAnalytics_Delete\",\r\n                                                \"Microsoft.Intune_RemoteAssistance_Update\",\r\n                                                \"Microsoft.Intune_EndpointAnalytics_Update\",\r\n                                                \"Microsoft.Intune_EndpointProtection_Read\",\r\n                                                \"Microsoft.Intune_AssignmentFilter_Delete\",\r\n                                                \"Microsoft.Intune_AssignmentFilter_Update\",\r\n                                                \"Microsoft.Intune_MobileThreatDefense_Read\",\r\n                                                \"Microsoft.Intune_RemoteAssistanceApp_TakeFullControl\",\r\n                                                \"Microsoft.Intune_DeviceCompliancePolices_ViewReports\",\r\n                                                \"Microsoft.Intune_PolicySets_Assign\",\r\n                                                \"Microsoft.Intune_ManagedApps_Delete\",\r\n                                                \"Microsoft.Intune_PolicySets_Create\",\r\n                                                \"Microsoft.Intune_PolicySets_Update\",\r\n                                                \"Microsoft.Intune_DeviceConfigurations_Read\",\r\n                                                \"Microsoft.Intune_TermsAndConditions_Create\",\r\n                                                \"Microsoft.Intune_AppleDeviceSerialNumbers_Delete\",\r\n                                                \"Microsoft.Intune_AppleDeviceSerialNumbers_Update\",\r\n                                                \"Microsoft.Intune_ManagedDevices_Read\",\r\n                                                \"Microsoft.Intune_AppleDeviceSerialNumbers_Create\",\r\n                                                \"Microsoft.Intune_Customization_Create\",\r\n                                                \"Microsoft.Intune_RemoteTasks_GetFileVaultKey\",\r\n                                                \"Microsoft.Intune_RemoteTasks_WindowsDefender\",\r\n                                                \"Microsoft.Intune_TermsAndConditions_Delete\",\r\n                                                \"Microsoft.Intune_MobileApps_Read\",\r\n                                                \"Microsoft.Intune_AndroidSync_Read\",\r\n                                                \"Microsoft.Intune_ManagedApps_Read\",\r\n                                                \"Microsoft.Intune_MicrosoftStoreForBusiness_Modify\",\r\n                                                \"Microsoft.Intune_RemoteTasks_CleanPC\",\r\n                                                \"Microsoft.Intune_RemoteTasks_ShutDown\",\r\n                                                \"Microsoft.Intune_SecurityTasks_Update\",\r\n                                                \"Microsoft.Intune_TermsAndConditions_Read\",\r\n                                                \"Microsoft.Intune_SecurityBaselines_Create\",\r\n                                                \"Microsoft.Intune_SecurityBaselines_Update\",\r\n                                                \"Microsoft.Intune_SecurityBaselines_Assign\",\r\n                                                \"Microsoft.Intune_RemoteTasks_ManageSharedDeviceUsers\",\r\n                                                \"Microsoft.Intune_RemoteTasks_RequestRemoteAssistance\",\r\n                                                \"Microsoft.Intune_MobileApps_Delete\",\r\n                                                \"Microsoft.Intune_ManagedApps_Assign\",\r\n                                                \"Microsoft.Intune_MobileApps_Create\",\r\n                                                \"Microsoft.Intune_RemoteTasks_Retire\",\r\n                                                \"Microsoft.Intune_TermsAndConditions_Update\",\r\n                                                \"Microsoft.Intune_DerivedCredentials_Modify\",\r\n                                                \"Microsoft.Intune_MicrosoftDefenderATP_Read\",\r\n                                                \"Microsoft.Intune_CertificateConnector_Read\",\r\n                                                \"Microsoft.Intune_RemoteTasks_EnableLostMode\",\r\n                                                \"Microsoft.Intune_PolicySets_Read\",\r\n                                                \"Microsoft.Intune_ManagedApps_Wipe\",\r\n                                                \"Microsoft.Intune_DeviceCompliancePolices_Read\",\r\n                                                \"Microsoft.Intune_DeviceConfigurations_Assign\",\r\n                                                \"Microsoft.Intune_AppleEnrollmentProfiles_Read\",\r\n                                                \"Microsoft.Intune_Customization_Update\",\r\n                                                \"Microsoft.Intune_PartnerDeviceManagement_Read\",\r\n                                                \"Microsoft.Intune_DeviceConfigurations_Create\",\r\n                                                \"Microsoft.Intune_EnrollmentProgramToken_Read\",\r\n                                                \"Microsoft.Intune_AndroidSync_UpdateOnboarding\",\r\n                                                \"Microsoft.Intune_RemoteTasks_DisableLostMode\",\r\n                                                \"Microsoft.Intune_RemoteTasks_RotateBitLockerKeys\",\r\n                                                \"Microsoft.Intune_MobileApps_Relate\",\r\n                                                \"Microsoft.Intune_RemoteTasks_RotateLocalAdminPassword\",\r\n                                                \"Microsoft.Intune_AndroidSync_UpdateEnrollmentProfiles\",\r\n                                                \"Microsoft.Intune_WindowsEnterpriseCertificate_Modify\",\r\n                                                \"Microsoft.Intune_MobileApps_Assign\",\r\n                                                \"Microsoft.Intune_ManagedApps_Update\",\r\n                                                \"Microsoft.Intune_PolicySets_Delete\",\r\n                                                \"Microsoft.Intune_ManagedApps_Create\",\r\n                                                \"Microsoft.Intune_SecurityTasks_Read\",\r\n                                                \"Microsoft.Intune_RemoteTasks_Wipe\",\r\n                                                \"Microsoft.Intune_DeviceConfigurations_ViewReports\",\r\n                                                \"Microsoft.Intune_CorporateDeviceIdentifiers_Read\",\r\n                                                \"Microsoft.Intune_Customization_Assign\",\r\n                                                \"Microsoft.Intune_DeviceEnrollmentManagers_Update\",\r\n                                                \"Microsoft.Intune_RemoteTasks_BypassActivationLock\",\r\n                                                \"Microsoft.Intune_DeviceConfigurations_Update\",\r\n                                                \"Microsoft.Intune_RemoteTasks_UpdateDeviceAccount\",\r\n                                                \"Microsoft.Intune_WindowsEnterpriseCertificate_Read\",\r\n                                                \"Microsoft.Intune_Reports_Read\",\r\n                                                \"Microsoft.Intune_MobileApps_Update\",\r\n                                                \"Microsoft.Intune_Customization_Read\",\r\n                                                \"Microsoft.Intune_ManagedDevices_ViewReports\",\r\n                                                \"Microsoft.Intune_RemoteTasks_SetDeviceName\",\r\n                                                \"Microsoft.Intune_TermsAndConditions_Assign\",\r\n                                                \"Microsoft.Intune_CertificateConnector_Modify\",\r\n                                                \"Microsoft.Intune_DeviceConfigurations_Delete\",\r\n                                                \"Microsoft.Intune_RemoteAssistance_ViewReports\",\r\n                                                \"Microsoft.Intune_Customization_Delete\"\r\n                                            ],\r\n                                \"resourceActions\":  [\r\n                                                        {\r\n                                                            \"allowedResourceActions\":  [\r\n                                                                                           \"Microsoft.Intune_Audit_Read\",\r\n                                                                                           \"Microsoft.Intune_CorporateDeviceIdentifiers_Create\",\r\n                                                                                           \"Microsoft.Intune_EnrollmentProgramToken_Create\",\r\n                                                                                           \"Microsoft.Intune_ManagedDevices_Update\",\r\n                                                                                           \"Microsoft.Intune_AssignmentFilter_Read\",\r\n                                                                                           \"Microsoft.Intune_DeviceCompliancePolices_Assign\",\r\n                                                                                           \"Microsoft.Intune_ManagedDevices_Delete\",\r\n                                                                                           \"Microsoft.Intune_AppleEnrollmentProfiles_Assign\",\r\n                                                                                           \"Microsoft.Intune_CorporateDeviceIdentifiers_Update\",\r\n                                                                                           \"Microsoft.Intune_AndroidSync_UpdateApps\",\r\n                                                                                           \"Microsoft.Intune_DeviceCompliancePolices_Delete\",\r\n                                                                                           \"Microsoft.Intune_AppleEnrollmentProfiles_Delete\",\r\n                                                                                           \"Microsoft.Intune_MicrosoftStoreForBusiness_Read\",\r\n                                                                                           \"Microsoft.Intune_DeviceCompliancePolices_Update\",\r\n                                                                                           \"Microsoft.Intune_RemoteAssistanceApp_ViewScreen\",\r\n                                                                                           \"Microsoft.Intune_EnrollmentProgramToken_Update\",\r\n                                                                                           \"Microsoft.Intune_AppleEnrollmentProfiles_Create\",\r\n                                                                                           \"Microsoft.Intune_ManagedDevices_SetPrimaryUser\",\r\n                                                                                           \"Microsoft.Intune_AppleEnrollmentProfiles_Update\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_ActivateDeviceEsim\",\r\n                                                                                           \"Microsoft.Intune_AppleDeviceSerialNumbers_Read\",\r\n                                                                                           \"Microsoft.Intune_EndpointAnalytics_Read\",\r\n                                                                                           \"Microsoft.Intune_CorporateDeviceIdentifiers_Delete\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_CustomNotification\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_PlayLostModeSound\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_DeviceLogs\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_RebootNow\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_RemoteLock\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_RevokeAppleVppLicenses\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_RotateFileVaultKey\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_SyncDevice\",\r\n                                                                                           \"Microsoft.Intune_AssignmentFilter_Create\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_EnableWindowsIntuneAgent\",\r\n                                                                                           \"Microsoft.Intune_DerivedCredentials_Read\",\r\n                                                                                           \"Microsoft.Intune_EndpointAnalytics_Create\",\r\n                                                                                           \"Microsoft.Intune_Roles_Read\",\r\n                                                                                           \"Microsoft.Intune_RemoteAssistanceApp_Elevation\",\r\n                                                                                           \"Microsoft.Intune_MobileApps_ViewReports\",\r\n                                                                                           \"Microsoft.Intune_RemoteAssistance_Read\",\r\n                                                                                           \"Microsoft.Intune_EnrollmentProgramToken_Delete\",\r\n                                                                                           \"Microsoft.Intune_DeviceCompliancePolices_Create\",\r\n                                                                                           \"Microsoft.Intune_DeviceEnrollmentManagers_Read\",\r\n                                                                                           \"Microsoft.Intune_SecurityBaselines_Delete\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_LocateDevice\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_ConfigurationManagerAction\",\r\n                                                                                           \"Microsoft.Intune_Organization_Read\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_ResetPasscode\",\r\n                                                                                           \"Microsoft.Intune_SecurityBaselines_Read\",\r\n                                                                                           \"Microsoft.Intune_EndpointAnalytics_Delete\",\r\n                                                                                           \"Microsoft.Intune_RemoteAssistance_Update\",\r\n                                                                                           \"Microsoft.Intune_EndpointAnalytics_Update\",\r\n                                                                                           \"Microsoft.Intune_EndpointProtection_Read\",\r\n                                                                                           \"Microsoft.Intune_AssignmentFilter_Delete\",\r\n                                                                                           \"Microsoft.Intune_AssignmentFilter_Update\",\r\n                                                                                           \"Microsoft.Intune_MobileThreatDefense_Read\",\r\n                                                                                           \"Microsoft.Intune_RemoteAssistanceApp_TakeFullControl\",\r\n                                                                                           \"Microsoft.Intune_DeviceCompliancePolices_ViewReports\",\r\n                                                                                           \"Microsoft.Intune_PolicySets_Assign\",\r\n                                                                                           \"Microsoft.Intune_ManagedApps_Delete\",\r\n                                                                                           \"Microsoft.Intune_PolicySets_Create\",\r\n                                                                                           \"Microsoft.Intune_PolicySets_Update\",\r\n                                                                                           \"Microsoft.Intune_DeviceConfigurations_Read\",\r\n                                                                                           \"Microsoft.Intune_TermsAndConditions_Create\",\r\n                                                                                           \"Microsoft.Intune_AppleDeviceSerialNumbers_Delete\",\r\n                                                                                           \"Microsoft.Intune_AppleDeviceSerialNumbers_Update\",\r\n                                                                                           \"Microsoft.Intune_ManagedDevices_Read\",\r\n                                                                                           \"Microsoft.Intune_AppleDeviceSerialNumbers_Create\",\r\n                                                                                           \"Microsoft.Intune_Customization_Create\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_GetFileVaultKey\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_WindowsDefender\",\r\n                                                                                           \"Microsoft.Intune_TermsAndConditions_Delete\",\r\n                                                                                           \"Microsoft.Intune_MobileApps_Read\",\r\n                                                                                           \"Microsoft.Intune_AndroidSync_Read\",\r\n                                                                                           \"Microsoft.Intune_ManagedApps_Read\",\r\n                                                                                           \"Microsoft.Intune_MicrosoftStoreForBusiness_Modify\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_CleanPC\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_ShutDown\",\r\n                                                                                           \"Microsoft.Intune_SecurityTasks_Update\",\r\n                                                                                           \"Microsoft.Intune_TermsAndConditions_Read\",\r\n                                                                                           \"Microsoft.Intune_SecurityBaselines_Create\",\r\n                                                                                           \"Microsoft.Intune_SecurityBaselines_Update\",\r\n                                                                                           \"Microsoft.Intune_SecurityBaselines_Assign\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_ManageSharedDeviceUsers\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_RequestRemoteAssistance\",\r\n                                                                                           \"Microsoft.Intune_MobileApps_Delete\",\r\n                                                                                           \"Microsoft.Intune_ManagedApps_Assign\",\r\n                                                                                           \"Microsoft.Intune_MobileApps_Create\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_Retire\",\r\n                                                                                           \"Microsoft.Intune_TermsAndConditions_Update\",\r\n                                                                                           \"Microsoft.Intune_DerivedCredentials_Modify\",\r\n                                                                                           \"Microsoft.Intune_MicrosoftDefenderATP_Read\",\r\n                                                                                           \"Microsoft.Intune_CertificateConnector_Read\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_EnableLostMode\",\r\n                                                                                           \"Microsoft.Intune_PolicySets_Read\",\r\n                                                                                           \"Microsoft.Intune_ManagedApps_Wipe\",\r\n                                                                                           \"Microsoft.Intune_DeviceCompliancePolices_Read\",\r\n                                                                                           \"Microsoft.Intune_DeviceConfigurations_Assign\",\r\n                                                                                           \"Microsoft.Intune_AppleEnrollmentProfiles_Read\",\r\n                                                                                           \"Microsoft.Intune_Customization_Update\",\r\n                                                                                           \"Microsoft.Intune_PartnerDeviceManagement_Read\",\r\n                                                                                           \"Microsoft.Intune_DeviceConfigurations_Create\",\r\n                                                                                           \"Microsoft.Intune_EnrollmentProgramToken_Read\",\r\n                                                                                           \"Microsoft.Intune_AndroidSync_UpdateOnboarding\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_DisableLostMode\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_RotateBitLockerKeys\",\r\n                                                                                           \"Microsoft.Intune_MobileApps_Relate\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_RotateLocalAdminPassword\",\r\n                                                                                           \"Microsoft.Intune_AndroidSync_UpdateEnrollmentProfiles\",\r\n                                                                                           \"Microsoft.Intune_WindowsEnterpriseCertificate_Modify\",\r\n                                                                                           \"Microsoft.Intune_MobileApps_Assign\",\r\n                                                                                           \"Microsoft.Intune_ManagedApps_Update\",\r\n                                                                                           \"Microsoft.Intune_PolicySets_Delete\",\r\n                                                                                           \"Microsoft.Intune_ManagedApps_Create\",\r\n                                                                                           \"Microsoft.Intune_SecurityTasks_Read\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_Wipe\",\r\n                                                                                           \"Microsoft.Intune_DeviceConfigurations_ViewReports\",\r\n                                                                                           \"Microsoft.Intune_CorporateDeviceIdentifiers_Read\",\r\n                                                                                           \"Microsoft.Intune_Customization_Assign\",\r\n                                                                                           \"Microsoft.Intune_DeviceEnrollmentManagers_Update\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_BypassActivationLock\",\r\n                                                                                           \"Microsoft.Intune_DeviceConfigurations_Update\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_UpdateDeviceAccount\",\r\n                                                                                           \"Microsoft.Intune_WindowsEnterpriseCertificate_Read\",\r\n                                                                                           \"Microsoft.Intune_Reports_Read\",\r\n                                                                                           \"Microsoft.Intune_MobileApps_Update\",\r\n                                                                                           \"Microsoft.Intune_Customization_Read\",\r\n                                                                                           \"Microsoft.Intune_ManagedDevices_ViewReports\",\r\n                                                                                           \"Microsoft.Intune_RemoteTasks_SetDeviceName\",\r\n                                                                                           \"Microsoft.Intune_TermsAndConditions_Assign\",\r\n                                                                                           \"Microsoft.Intune_CertificateConnector_Modify\",\r\n                                                                                           \"Microsoft.Intune_DeviceConfigurations_Delete\",\r\n                                                                                           \"Microsoft.Intune_RemoteAssistance_ViewReports\",\r\n                                                                                           \"Microsoft.Intune_Customization_Delete\"\r\n                                                                                       ],\r\n                                                            \"notAllowedResourceActions\":  [\r\n\r\n                                                                                          ]\r\n                                                        }\r\n                                                    ]\r\n                            }\r\n                        ]\r\n}",
                  "https://graph.microsoft.com/beta/deviceManagement/roleDefinitions",
                  "_RhinoRole",
                  [
                      "943abd2b-1916-4ec2-8468-54563dfa8d07"
                  ],
                  "No Available Assignment"
              ],
    "Count":  5
}